node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 5775968
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "F\312\017>Bf>\274_\276)=C\341\014=\331\025\247\275\ra\250=\210\226f\275t\032\327\275\360k\376\273h\220m\275\326\"4\276\342E\211\275t\324U\276\234a\215\274\272\373\241\275U\026\024=^\026[<\242\024\203>pf\216\274P\'\351=\363\"\002\275\252\207[=+\233~=\215\030\026\276\213|\355\274E\2321<\307\363S\275*/\320=\303r\307\275\330\372#\275\243\r\232>\2233-=4\022\376=4\264@<,\202\323=G\267\202=v6\351=\362\315[>\203\375\014>\344\350C\275x\361\007\276\214\301+\276\367\3151=\333\264;>;A\020\276=\212\317\275\2749\346\274M\326>==\222Z\276\306\3650\275;\371\372=\227@]>\0353\024\275\002\303\233\275\231\313[\2765\006~>\207x_\276\227\333w>\025\365\026>\322\227t>\332\250\032\2764\213H>\274\3318<\"95\276\206t`>\321e\375\275\215A\350=\304\\\201\276G+%=\036\"\000\275\357\363M\276D\013\030\276\007\257o\275\276\244\325=\254&]>@\030\027>\251\306\350\274b\256p=\277\273\036=\263+L\276\364\233\366\274s\"\355=\000)\200\276\332W\271=\357y\303=\301\366\343\275\037A\230\276J\037\300\273\222\211+>\221\335\202\275\003p\225=)j\266=\3575l\276W\213\n=\230}\211=Yo\021;\213\334\303<(g\233=\363\230\271\275dB\026>\232\007\263\275$\352\331\275\027.:\276\303n=;3?\014>\237\235\3769\221\370\r>%Z\000>tM\366\275\316\245\331=\006\276\231=\255\027z\275\026\374\030>m}\022>\303T\004>z\271\004>\367>b\275\324q\253\275\250\210\014\2753s\316=\030\344\035\275&wN=\020\241\333\274\354M\267\275Ov\270\276\306\024\'>\273\207R>\370N\024>\220;\235=\0279O>3\001\332=\311\371\016\276Q\271H=\215\267\026\276\212I)\275\326L\203>t.\016>\\\325$>J\277l=WK3>\236\314\246\275>\210\243\274^\025\232\276\026[W=;\274\327<\017\004+<\352\000\034\276>\370\027>n%\220=+\225\274\274\255\227\217=\034\250\300=\255><=\\!\256\275\245}\313=\\!\321\274\006\247_\274mo]\276MoG>`\247\226\276j\257\234\274\026\353\007=J%\030\276.\006\r\276P\311\233=\362o\352=\272\233\021=P\"\327\275\'X\262=\377~7>\023\345\032=\307\211\251<\374Ak=\350k&\276\tT\256=O\247\215\273\003\027$\275)\337\252\274\253\t\266=\231\265\274\273\031\205\242>$\225\262;\006\006j\276F\251\236\274\276\342\024\275\357U\366=W\272b\273\32321=\336\257\215=\220\022I=\305P\334==R\r>\027<b\274\302&\273\2752\177\220>+\232\202\275\340\344\227\275\367w\337=q0\253=\356\311\206>\333\232#>\256\203\332\274\\\023\016\274\356\211\005>\350Jo>\002\2360=\025mx\275L\221\266\273\202\322\307\274\212\205\237\275\377\350\"=\334\'\034=\216>\370\274\237\321\216=$\237O=\206\347\3309\2505\014>F\340i\276-\323\204\275\n\016\231>,g>>\\\237\211=\311\332\270<w\325\r\275\205\3250\276\340\277\200=\305%q=\226\331y<>/O>\t\r\207\275\224^\r>\201\245\020>T\374\020=j\023\235>\252\350\254\274\321\1776>\254\036?\275\314Rn\275\2703\275\275\376\355\371=Q\374)\276\220\033\271\276p\334>>\363x\323=m\374\250=Q-\204=\372\024\241\275*\205\321;\021\210\201\274PA+=\007\206\336=o\244\205\275_\305->\2454\353\275\350u\232=.\016\023\276\251\207P<T\237\251\275\203\371\370\274\243d\t\273Nc\202\272`!^=<\255\357\275\267\217\024\276u1\277;\021Oz>\022\206\23491bK\276\275_\034\2768\214\003\276\324\313\350=\307H!\275E\022\016>\301\306\243<P\251T<\264\010\000\276\217\376\307=\350\201\007\274\016\327\361\275\031\322\001>\372b\345\275\005\216\377\275<l\241\275,\363\022\276\363p\316=\343\346\212\276\335\217S=\253.G\276,\231\310=\347(\217>\224\021\265\274jHo=\005\264.=\327(t\275\273bN>h5\227>r\013\320\274\307;*\275+\205]\274*i\337=\212\363c>!EG>\317\211\337=\367\271\032\276\221L\014\276\240\265\026\276a#W\275 \324\n=\033:\000\276[\311>>94\335\275{\327\243\275^fS\274@\376\373=\232\313>>\022\305a=\215\355\220\275\301\231\242\274i\323\226=\364\334X\275\206\200\017\275j\200\307\275\364\320B>\356>X\276XT\020>\242\361+\275\232\221\037>\353\303\'=\244\356\207=tsz>\270K\002>\275}\022>\217\210\344\274\321C\355\275\341\212@<\375\'\230\274\323\226\321\275o\352\254=\261>4\276)\016\332<\225\264~=k!\177\275\326U\006>\201\3666\275\346<1>\210\366\252\274W7\311\275\261\373\220\276\203\363\251=|\177\221=C\366\335=\013sU>h!\346=2/:\276\244k\237=\177\031Y=\273\324\242>B\036\236\275\001\026\373\274U_\007>U\234\271\275Q\263P>%\376\270=\271\204.=i@i\274\332\264h=}\026C>y\224\030>X\301|\2768\237\005\276\014|v>\374[\222=\346%\331=.B\362=\017\350I\276\006\3605\273\313GZ>\205\232\341\275\366\255\';\263z\021\276\377\305#\276v\367\">\371\333\353=Y]\214=\313\035\013>\230.\022\275\033G\246\275\212\263\265\272\247_\222=Hcj=f\302@>M*\n>\3607\033>L\0240\275_E\230=\017/\322\274\220\241\341=T\030s\276\226\224)\276\375\'S>g\326\355\274\222.\244\276}\271\'>\t\036\335\274\372w\227<\317\021\240=\304\017#>\304y\314=\346\211\211<]\005s=m\n8=\322\251\356=\230\272\316\275S\367K\274\356\336;\276\373\206\234\2743%\211\275\244\005\210=\355\277\300\275u\227\364\275)\305];\306\3319\276\262\231\365<\357\375\322=R\306\021\275\336j\316=Q\025\337<\334\021\000>\030\346`\275\243\264\224\274\311\313\020\276\245V$>\311\374\276\275\030jZ>\243\363\027=,\3738=F$\225\275\n\273 \275\206j\350=\033\243$\275\026\277\n\276\233-\205=\203\267\357\275Pm\330=\022\275\334=L51\275\2411\326\275\355y\235\274\210\025G\276\227\226V>\317/h>\304\307\206\276\177\235v\276\212WA\275{\014\233\275\275\220\263>\372.\300=P;y=\361F\274=}\006%<\002-\005\276V\037\207<\351\371&=\300\351[\275\353\351\340=}\313\010=\220,\313=\267M_\274\263p\275>\325\230\273\275Rz\215\276\tV\021<\230S1>\240uX\275Z\"\217\275\027\241)\274\225\035\206<\253\316\312=\362\014\264<P*A5\307\314z\275{\010\014>=\244\000>\345\262\031=\317cE>\307\346K\276\320\024\034\274\315\314\005>N-O\275\224\027\263\275\341\370>\275\256\235\010\276\333x\310\275\001A\364\275\00342\276N\025\336=\224\016@\276\272\333\203=\314y\227\275|y8=\335\234L>b\352>\273V\320\220\275r\313m=x\266\225\274A?.>\363\324Z\276\316\343\036\276\307J\266\276[5\362=\274\316\326<\333\021H>\273\371\376\275/\002X\275\rQ\352=\224\377w\275\305\304\323\275\250\370\275\275\367\027\005=\343\2033\274\314\027]>\305\247?=\016E,<\255\014\266=_\313:\276\0263\246\275\340\254\037>C\007\274\275\211w_=`\256`\275D\255\327<\246\371q>C\"\315=\204\346!\275\276\002\027>}p\266\275\216\000\205=6\376G>ECD=D\266\200\276\301`\250\276\260\3016\275\365\r\331\275[\213R=\177!Q\275\374\312A>@\033(>\304\203\351\275\234\311\351=k\030I\275\026a$\276\351=\202=\343\375\265;@/{>\331d\n=~\344\004\276J\327\221\276\2127\243\275t\202u\275\031a!>>\232+\276E\007\263=\'\334\227<\226\3651\276\325\327\364=\323\315\034\273/k\201\2755[\324=\341\253\273=\347\373\345=\250\303\210=Z\1776>\357\207;\274y\022a=A\010A\275\276\030`\276\247Xe=+\223\333\275\340\312\267\275\254\251\016\276\026\250\222>Q)\207>w\240\010=\033\264S\275B=\236=\341\r>\276\222)\253\274\222\221\023\274\342\304Q\275\3273\237=\232I\261\275(K\202=\rP\311\275\301\006\326=\356\024>\276\207\350\034=T}\222=J-)>\\\357v=\232\343\t\275D\355[\276Sz\236=\"\202\376>N\311\315\275\215:p=\364k\326\275\261\243\337<\0016\304;\354\225\264<\263\247\335=\305\366\004>\210&\005=\n\372\223\275\360n\206<\2035\340=\035\007\333=\005\252C\276p\2642\274b\032\"\275\233\232;>^B\004=\340IP=\002Jf=W2\t>\303\261\375\274\370\334\376<\rj\000>w\014\233\275\\\233\003=\271B^\275EiE>\361\312\016\276\236\032\376=\271%\001\276$\324\030>\242\023I>F\221\220<\243\234\t=\t\333\220\274\212\321d=b\277\010=\215l/>\201\026\335\275;L\010\276\315i]\274\3100\027>r\237\001\276^\333\311\274\025^\350\274\322\217\244\275\302\233\005>\267\002\226\275\n\323\374\275\213\350\t>\2000x\276\023.\357=|\310j<\232\366<\276\327\177i>^\272\014\276wD/\276z\211\220=N\022\022\276\321\247\025\276\223<\251=\360\316\t=\341\200H=\371\010\034\275\226\n\304>\2146.=S<\264=\220\353?=\026\t\245=H\342\272<\266b$>\332\216\247\275@\037\276=\310\217c=\247B\3619]\313\243\275\3057#>E\007\003\276[\330\305=t\003R\275\222\201\025\276\261\377-=Q\177\273\274\361:\245=V/:\276\014\'\330\275i\326\331\274+\232\006\275=\"\031\276x\302\214\276\313\037\032>r^~>v\247\276=?\337\252\275\311\357\223\276\016\332\t\276\026`\264\275\271s\203\275OC\227>rN\205\275\361B)\275\')\213=e\tI>dYU\276t\021\343\275\334\022*=\022\363E\275\201R\001\275\344\004\362\275\211p\025\275\2121L\275\204Jo\275zOE\274\360$\026>\307\227\206=\306\216\323=F\020\017\274^\n\374\274T\310\203\274;\303B=\272\377\362=]\020\"\275\236\340\267\275\271\361\245\2755\314\374\275\324\330\327<\321\305\213>\n\027+>\233\274\212\273\356n\204\276C\332\370=\316p\203>`\331\322\275F\323?=\310\234g\274M\322m<\216\177\365\275A\033\250\275z\315\304=Z\030\275\275\210Q\216\275\320\026\245\276\267R\205\2763\337\205\276\004\240\247>\"\0004>,\305\014\275\267\217\326\275\001\362\266\2742\021\356<X\306\302<\273\353!\274\253~\207\273\021f\013\274\033I\277=\214;\204\275\320\017\223\275\2536\334\2747.\214=\265\206\362<\003\321\016\276\313\260\373\275k\215\003=\305\3264\276\232B\033=J%\335=\252\035\025\276\221* =2FA\276\203\304\003>\375O\270<g\274\326\274v\341\266=tOO>\022\367\342=\316c\305=t\350\\>\3151\376=\263eo=\214\3214\275\2159\215\275;\213\031\276\320\367\240=\363\255\210;d\213\341\274\032\201\035>\206\210G=\372\017O>vX\341\275\206\274\001>4\362v:\342K\323\276`44\276\266\222\000\276\224\321Q\276\331\226\004\275u\206\n\276Q\261\335=\237\343#<\352qF=1 9\276K\027\336<a(d\275!\034\203\275\025\353\344=\362\273\352\275\226Kv\275\317\356\234=o]\261\275|rC\276\r\365\006>^\321R=\240\376*\275C\302\313\275\243\203E>\002\334&\276}H\n\276?\036\244<y\'T\276I\242\310<\035Y\273\275\205\252\334\274Y~\354=\353R}\275\2420?=\022\353\r=:\177g=wm\270\275\334\t\217\274\177Z\214\275[\322\177<\303\270w>\371\037\203<{\2239>\341\206\235\276{\246\013\275\225v\334\274w}\'\276%f\212\275 \222A\276\224\373\321=\261\345\223=\341\037m\275M\177y\275\300\177\204>\356\321-\276GY\023>\261\365\n==\214\035>\216\025\201>\022\"\315\274\217{\017\275F\203\006\275\355\003\235;\205\346,>2,P\275\250\037w=a\223z\275\033\302;\275\002\0308\276\244F.\276{tS\276S\245_\275\334\345\035\276\200\331U=N\202\215\2753\177\276=\230u\256\275\226{d>\346\264@\2769\355\364<\010\357\r=\370\233\365\274cY\207\275\236\354\237>\252\270\033=\367\202q>\033\256D\276\364y\034\276\312\207\022=Y\205\205=\347\2240=6\324\233\274#p\211=0\350\362\273\027\372\376\275\257\210\353=\200\346\201>\016\321`>]\2732\275=Q\326\274Md[\275w\0367>\261\310!\275!>V\275O\365\203\275C|t\276w\327\">\261\337\247\275\276P\210>Zk\n\276\263\037\202\276\367#\245=\227:{\275\262mI>\254X\276=C\360(>\363g\374=\377\006I=#\377\305\275\225\212\000\276\347~4=X\366\231\275\253-\242\275T\345\376=\326\235\007>&\263N\276\2154\225<EC6<\330\306!\275\247\377\375\2720[->\246\327\207\275m\265:>\373*\003\274J\310\247\275\202\332\000\276\246\014\010\276\3706\265\272OY\006\275\301$\311=\273\r\331\275\266\307:\276TT\207>N\225\366\275\312\021\217\274\240\270\237\275HJT\276\272\270e\274Yy\317=\310\264\302\275\214\303\234\274V\036u\275\341h#=rxN>o\034\264\275\374[\266<e(\r>\210\256\220>\020\303<>\270k\314\275\255\317\237;\022:\267=\344\"G\275au/\275\362\306\377=\003E\000\276o\026\032>$\351\300\275\264b\235>\007\016\024\276\232\304\213\275\245w\341=)}l\276\2770\024\276\356\014\210\276q\336\220\275<<\304=\220\321\024\276\355\306\375\275Bx\026>\213)\002>\006/\376<\311\255\032\274n\237\313\273eH\277\275\'t\302=v\255\021\275\257\"\205\275\230\033Q\274\232\0060\276\006M\372=]\271`>dZ\234\273\025\000K=W\212\226<\333\"\033\275\301\372\256=nip>5DP<W\021N\275j\307\217>\360C\025;WV\236\276v\330&=\332l\327=\020_\317<\355l\222=\2039$\276MxV<9\242\246=\237\266\"\275\373\252\305=v\372p\276(\311\000\276+L\373\275#\240\030\276|\236\262<\267\236.>xI\000\275\341v(\275\0333k=\267\260\216=\276%\034\274\006k\024\275>\370\363=\020\343B\276b\037\347=K?\222\274\3040.\276A\276\033\276\346\266\205>+\350\240\274\340\2713>QZ\272=\332\035d>\254\341\004=\205\257\355=\267\362:\276\273J@\276m\364\352\274/)\253\274qk\204\274\205\261\276\272\341#\307\275\356\020\022\276U\376\246>\304\222p>\377t\304\274g\272\013\274p\014\\\274\244\017\312<\3779\203=\316\321T\276\010\226Z=4o\352=o\234\210=\353L\016\276\342Z\201\275r\226\\\274m\360\021>\316\372\251\275\020\302!\276\240\'\177\275\201\234\210\274\265l%>\322\2144=C\256\324;\235\255\346<\213\312\245>\265\322#>5\305\353\275\272o7\276\245a\014>1;-\275\247ay=\213\212\002\276\332\220U\275\353\006\370=jZa\275\326\010\330\275\344g+\275se]:\313GE=.\356\362\275\2055\026>C-\034\276\336\035\r\276\212\351\204\2756\325\276<I\013\247\275\233\'\270=\313\231\014=\334\245y\276\264\313\227\276\005H\037>\310\037\330\2756\034f>R\016\321<i;\206=\262\375h\276qt\305=\316J\n><\307@>\272y~\275a\235\251\274\220|\314=\234\033Q\276\330\236\036>\207\014\314=\244O\033=)\207X=\372}\357\275sR(\275\216+6\276\206Rj<\365\243.=\304\211\242=\365\306%=*/\224\276\242\023\005>\237\326\031\275f\276d= c\311=\275t<=\356\240T=;$\312=\022\335\241<\371\224V\275\241L\023\276+\2278\275/\235.=T,\032\275\2114,>\233T;\274\215\240\217<\214\372\243=lzw\276\213\303\356\274\002`\377=^`\376=y\031\t=\270U\251>\016\271/=\242\354\264\275q\300.>\225C0=]\027\277=<\241\234\274\227\273\022\276\246S\266=\311\030\005\275\304(%\276%\200\270<r3\223\275\227V\200\275\345\355=>7gA\275_\316\300<~\253\201=\036\207\243\276\272\006D=9\230\017\274v\364\251\274\3007\231=\346\"S=\307\246\236\275$\301P= n\300=>\036\344\274\234)\244\276y\214\350=\\a(\276[gw>\370Y\213=\354\3640\274u<\342\273\315\304\363\272\324\324X\275\005\240A<i\332\202\275\320\246\016>Da,>\202hg\275\274\270\207\275\225\321\205=E7t>T\221S>\255\237\245=\232y\212>EO6>7\335\347=`\276\224\275Q\313@\273\363\277\303=\357z\301=\037\262:\276\365\265-\275\206\\\037<\230\024\204<J2F>,\205\261>\207\344\245\274u\356\303\275\276\214\316=\324N\r>"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_1"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_11/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_11/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_11"
  op: "StridedSlice"
  input: "net/Shape_1"
  input: "net/strided_slice_11/stack"
  input: "net/strided_slice_11/stack_1"
  input: "net/strided_slice_11/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/Shape_2"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_12/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_12"
  op: "StridedSlice"
  input: "net/Shape_2"
  input: "net/strided_slice_12/stack"
  input: "net/strided_slice_12/stack_1"
  input: "net/strided_slice_12/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones/mul"
  op: "Mul"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/Less/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: 1000
      }
    }
  }
}
node {
  name: "net/ones/Less"
  op: "Less"
  input: "net/ones/mul"
  input: "net/ones/Less/y"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones/packed"
  op: "Pack"
  input: "net/strided_slice_12"
  input: "net/strided_slice_11"
  attr {
    key: "N"
    value {
      i: 2
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "axis"
    value {
      i: 0
    }
  }
}
node {
  name: "net/ones/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones"
  op: "Fill"
  input: "net/ones/packed"
  input: "net/ones/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
